Core/src/DataProcessors/ЗагрузкаКурсовВалютГрузия/ЗагрузкаКурсовВалютГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсовВалютГрузия</name>
  <attributes>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Core/src/DataProcessors/ЗагрузкаКурсовВалютГрузия/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗагрузитьКурсыВалют(Команда)
	СчитатьКурсыИЗагрузить(ПутьКRSS, РежимВыводаСообщений)	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьКRSS = "https://nbg.gov.ge/gw/api/ct/monetarypolicy/currencies/ka/json";//"http://www.nbg.gov.ge/rss.php";
	ТекущаяДата = ТекущаяДата();
	РежимВыводаСообщений = Ложь;
КонецПроцедуры

&НаСервере
Функция СчитатьКурсыИЗагрузить(ПутьКRSS, РежимВыводаСообщений)
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	//ДатаИзДанных = ОбъектОбработка.ЗагрузитьКурсыВалют(ПутьКRSS, РежимВыводаСообщений);
	ДатаИзДанных = ОбъектОбработка.ЗагрузитьКурсыВалютSSl(ПутьКRSS, РежимВыводаСообщений);  //Lazare 25.08.2022
    ЗначениеВРеквизитФормы(ОбъектОбработка, "Объект");
	
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИсториюКурсов(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаКурсовВалютГрузия.Форма.ФормаИсторияКурсов");
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладки(Команда)
	Объект.РежимОтладки = не Объект.РежимОтладки;
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.ТекстОтвета.Видимость = Объект.РежимОтладки;
КонецПРоцедуры
